[
    {
        "id": 1,
        "name": "What You Should Know About Working With Real Estate Agents",
        "lesson": "The North Carolina Real Estate Commission requires that we review their brochure with you! This document, Working With Real Estate Agents , is a thorough explanation of how agency works in North Carolina. It is not a contract; your signature is simply an acknowledgement that you received the information. Click Below to sign Then hit next."
    },
    {
        "id": 2,
        "name": "Financing",
        "lesson": "For purchasing a home, there are basically 4 loan programs being used on a regular basis: VA, FHA, USDA, and Conventional. VA is for Veterans. It offers 100% financing. It  is the best loan program available, not only because of no money down, but also because of it's leniency with regard to credit history. FHA is for any and everyone, but it requires a 3.5% down payment..It is also a good way to buy a home because of it's leniency with credit underwriting; however, FHA requires borrowers to pay monthly mortgage insurance premiums, which cause the mortgage payment to go up slightly. This loan may also be used with the NC Housing Down Payment Assistance program. USDA is loan program available for families whose annual household income does not exceed $74,900 (this applies to most counties in North Carolina). USDA offers 100% financing. Although USDA has a monthly premium, the payments are still lower than FHA and you do not have to make a down payment. Bear in mind, only certain areas qualify for USDA loan programs because this program is geared toward rural development; fortunately, several areas in Cumberland County and many of our surrounding counties are USDA eligible. Conventional financing requires a down payment of at least 5% and above average credit history. Many people who use Conventional loan programs are financially prepared to pay down more than the minimum 5%. If you choose the Conventional loan program, and finance above 80% of the sales price or appraised value (whichever is lower), you will be required to pay a monthly fee for Private Mortgage Insurance (PMI). It's worth noting that Conventional interest rates are slightly higher than all the other loan programs mentioned above."
    }
]